#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=e2584cbb-77a2-443d-b6c7-e3436ddf47eb-00685ac7-79c2-49be-91b5-9996f272ffab-4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3]
azuread_application.ACR-access-app: Refreshing state... [id=2e293956-b8a5-4ff5-92e6-2b3c355cbaec]
github_actions_secret.github-acr-access-app-id: Refreshing state... [id=Project-F:SP_APPID]
azuread_application_password.ACR-access-app-password: Refreshing state... [id=2e293956-b8a5-4ff5-92e6-2b3c355cbaec/password/cb7bc7f7-d121-492a-a26a-a06ba3c88b3a]
github_actions_secret.github-acr-access-app-password: Refreshing state... [id=Project-F:SP_PASSWORD]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2022-07-29 22:14:45.005364964 +0000 UTC]
azurerm_resource_group.rg-projectf-dev-002: Refreshing state... [id=/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-dev-002]
azurerm_resource_group.rg-projectf-dev-001: Refreshing state... [id=/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-dev-001]
azurerm_container_registry.acr-dev: Refreshing state... [id=/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-dev-002/providers/Microsoft.ContainerRegistry/registries/acrprojectfdev001]
github_actions_secret.github-docker-server-name: Refreshing state... [id=Project-F:DOCKER_SERVER]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_service_principal.ACR-access-service-principal will be created
  + resource "azuread_service_principal" "ACR-access-service-principal" {
      + account_enabled              = true
      + app_role_assignment_required = false
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_id               = "9f5d9622-1246-4d50-8357-be55b4919d4d"
      + application_tenant_id        = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = (known after apply)
      + type                         = (known after apply)

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # azurerm_role_assignment.acr-role-assignment-dev will be created
  + resource "azurerm_role_assignment" "acr-role-assignment-dev" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-dev-002/providers/Microsoft.ContainerRegistry/registries/acrprojectfdev001"
      + skip_service_principal_aad_check = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Retoxx-dev, Action: `pull_request`*